---
kind: property
id: P:Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.Speed
source: html/62fdd863-88f8-aa92-d93a-445b57971471.htm
---
# Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.Speed Property

Speed(bytes/second) in this event.

## Syntax (C#)
```csharp
public double Speed { get; }
```